# Taps
tap "homebrew/cask"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"

# Utilities
brew "coreutils" # Those that come with macOS are outdated
brew "moreutils"
brew "findutils"
brew "bash" # Latest Bash version
brew "wget"
brew "vim", args: ["with-override-system-vi"]
brew "grep"
brew "gnupg"
brew "bat" # "cat" on steroids
brew "youtube-dl"
brew "telnet"
brew "watchman"
brew "ffmpeg"
brew "zlib"
brew "pandoc"
brew "httpie"
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "mackup"
brew "trash" # Manage trash bin
brew "mas" # Mac App Store manager
brew "tree" # List directories in a tree structure

# Navigation and search
brew "autojump"
brew "fd"
brew "fzf"

# Brew services
brew "postgresql"
brew "redis"

# Git
brew "git"
brew "git-lfs"
brew "git-flow"
brew "hub" # A command-line tool that makes git easier to use with GitHub
brew "gh" # GitHub’s official command line tool

# Kubernetes
brew "kubernetes-cli"
brew "openshift-cli"

# Cloud
brew "awscli"

# Development
brew "yarn"
brew "autoconf"
brew "pkg-config"
brew "clang-format"
brew "protobuf"
brew "golang"
brew "boost"

# Development
brew "mysql"
brew "nginx"
brew "node"

# Apps
cask "minikube"
cask "minishift"
cask "1password"
cask "docker"
cask "google-backup-and-sync"
cask "google-chrome"
cask "slack"
cask "the-unarchiver"
# cask "alfred"
# cask "bartender"
# cask "caffeine"
# cask "imageoptim"
# cask "postman"

# Quicklook
cask "qlcolorcode"
cask "qlstephen"
cask "qlmarkdown"
cask "quicklook-json"

# Mac App Store
mas "Giphy Capture", id: 668208984
mas "Magnet", id: 441258766
# mas "Spark", id: 1176895641 # https://sparkmailapp.com/
# mas "Things", id: 904280696 # https://culturedcode.com/things/

